Revit 2027 API
BalusterPattern.EndSpace Property
 The extra space added after a whole baluster pattern.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double EndSpace { get; set; }
Public Property EndSpace As Double
	Get
	Set
public:
property double EndSpace {
	double get ();
	void set (double value);
}
member EndSpace : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for endSpace must be between 0 and 30000 feet.
See Also
Reference
BalusterPattern Class
Autodesk.Revit.DB.Architecture Namespace